<#import "/include/layout.ftl" as layout/>

<@layout.my_project>
<div class="col-sm-8">
    <div id="2015">
        <h2>2013年
            <small> - 信息提取及处理</small>
        </h2>
        <div class="slide">
            <h4>项目简介</h4>
            <p>2014年的特别之处在于：</p>
            <p>- 管理新系统外包项目</p>
            <p>- 管理SEO优化外包项目</p>
        </div>
        <div class="slide">
            <h4>新系统外包项目</h4>
            <p>随着市场的发展和单一的销售模式遇到天花板，公司决定要引进第三方商家进入商城。要让第三方商家能在我们的商城中卖东西，就必须有单独的系统供第三方商家来使用，原有的网站商城系统只能售卖自营商品，很多销售模式，正向、逆向流程都会有很大改变。出于各种成本和风险的考虑，公司决定将这个项目外包出去，由外包公司重新写一套系统来替换掉老系统。</p>
            <p>这个项目应该说是完全由我来负责，我来管理、协调整个项目的进度、和公司其他部门的对接、需求的整理。</p>
        </div>
        <div class="slide">
            <h5>失败的项目</h5>
            <p>最后这个项目勉勉强强上线了，但是在我看来是一次很失败的项目，总结原因，主要有这么几点：</p>
            <p>- 项目的合同没有严格制定。因为是我们的第一次外包项目，我们之前也没有做过第三方系统的经验，所以我们在制定合同的时候很多条款、要求都没有写死，用了很宽泛的词语，希望能在最后验收或者涉及需求更改的时候有补救和讨价还价的机会。但是这点也被外包公司所利用，导致项目的很多方面出现了敷衍了事的情况。</p>
            <p>- 项目的初期没有体现出甲方的强势。因为我个人作风的问题，所以项目的一开始，整个工作的氛围非常的轻松，对于项目中出现的各种延期，我都没有要求大家加班和追赶进度。但是工期表在制定之初已经考虑到了外包公司能力和是否用心的问题，是一份很宽松的工期表。这样甲方不着急，乙方就更不着急了，所以逐渐出现来懒散的状态，并且外包公司对项目的延期的态度也渐渐觉得理所当然的了。</p>
            <p>- 项目中期出现不适应的情况。由于前期的进度有所延误，我在项目进行到一个月的时候立刻转变了平时管理项目的态度和方式，措辞变得严厉，质量的审核变得严格。这种由宽松到严格的转变使得外包公司出现了不适应，他们对我的管理产生了抵触的情绪。</p>
        </div>
        <div class="slide">
            <h5>教训</h5>
            <p>所以，通过这个项目，我得到的经验教训是：</p>
            <p>- 能不外包，就一定不要外包。其实市面上还是有很多外包公司是非常有能力的，并且是非常主动的想为客户解决问题，甚至我也觉得我们找的这家外包公司也是一家以为客户服务为重心的。但是外包项目最大的问题是甲方乙方的不信任，甲方希望项目一定要做好，但是觉得乙方就是糊弄赚钱了事，不会保证项目的质量、代码的质量；而乙方又会觉得只要甲方在扣质量，在认真的审核就是在找茬，就是在为最后不付清尾款找借口。双方这种矛盾的心里就会导致项目的质量下降，双方的沟通成本增加，为了一点点小事都会花很长时间计较。</p>
            <p>- 由严格到宽松容易，由宽松到严格难。就向常说的：由俭入奢易，由奢入俭难。甲方的管理态度一定要在初期定在一个较高的水平，这样让大家都在项目的初期认真起来。</p>
        </div>
    </div>
</div>
</@layout.my_project>
